<template>
  <div class="preface">
    <p class="title">序</p>
    <p class="content">
      去年刚入学开始，就有了做一个个人博客的想法，并付诸实施，前前后后也做过几版，都因样式和审美问题半途而废，总觉得不如人意，没有达到我心里的预期效果。
      后面也看了许多优秀的博客设计，大多华而不实，过于追求界面的华丽、精美，忽略了博客作为日记的电子版所应该具有的功能。
    </p>
    <p class="content">
      直到近期，伏在桌上午睡时，偶然看到了桌上一本厚厚的书，心中一丝惊喜闪过，突然明白，博客作为记录和表达自己想法的载体，作为日记的电子版，做成书的样式，不是很好吗。
      于是就有了现在这样，样式类似一本书的博客界面。
    </p>
    <p class="content">
      既然是书，首先得有一个书名，最先想到的就是某诗人的三部曲《童年》、《我的大学》、《在人间》，我现在这个阶段，多多少少应该算在人间了吧。然后转念一想，这么富有文学气息得名字，
      用在我身上好像不太合适，有点过于做作，干脆就叫《在人间凑数得日子》吧，写下这个名字时，我不得不停下来自豪一下，在取名上，我还是很有天赋的。作家都有笔名，用自己的真实姓名在博客上署名也不太好，
      最快闯入我心里的笔名就是下面这个了，可能有很多人都知道这个笔名的出处，没错，就是我们小时候看的《风云》里面的一个女孩。为什么会突然想到这个名字，我自己是有解释的，其一，从金庸剧时代过来的男孩，
      在小时候或多或少都有一个武侠梦，而聂风和第一梦的故事当年刚好播种在了我的心里，具体的剧情我已经记不太清，但是他们之间感情上的遗憾我却一直记得，也许这就是不完美才是最美吧。其二，单说第一梦这个名字，
      第一梦，第一次做的梦，多么像我们曾经拥有过的那个人，我相信《风云》的作者也有此意，我能想到这个名字，也许我还记得当初的遗憾。
    </p>
    <p class="content">
      书的结构和传统的纸质书相差无几，封面，序言，目录，版权，尾页，留言，版权和尾页我还没敲定，就先按照这样的顺序来吧。封面和序言无须多言，所见即所得，在目录上，由于每个目录下
      文章数量不好把控，不好在目录页展示，点击目录后，会在一个单独的页面展示对应目录下的所有文章。在版权页有我的个人信息，如果对我感兴趣的话，还可以在留言页给我留言。尾页大概就是一些感谢的话了，
      类似于致谢。
    </p>
    <p class="name">写于 2020年10月20日 第一梦</p>
  </div>
</template>

<script>
export default {

};
</script>

<style scoped>
.preface{
  /* background: blanchedalmond; */
  width: 450px;
  height: 700px;
  margin-top: 50px;
  margin-left: 35px;
  overflow: auto;
}
.title {
  font-size: 70px;
  font-weight: 500;
}
.content {
  text-indent: 2em;
  margin-top: 10px;
}
.name {
  text-align: right;
  margin-top: 10px;
}
::-webkit-scrollbar {
  width: 4px;
}
::-webkit-scrollbar-thumb {
  background: #e2e1e1;
  border-radius: 2px;
}
</style>